In [1]:
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import datasets 

iris = datasets.load_iris()
wine = datasets.load_wine()

In [2]:
from pandasql import sqldf
import pandas as pd

In [3]:
df = pd.DataFrame(iris.data, columns=iris.feature_names)
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [4]:
ds = df.rename(columns={ "sepal length (cm)": "sepal_len", "sepal width (cm)": "sepal_wid", "petal length (cm)": "petal_len","petal width (cm)": "petal_wid"})

In [5]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sepal_len  150 non-null    float64
 1   sepal_wid  150 non-null    float64
 2   petal_len  150 non-null    float64
 3   petal_wid  150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

A query to get sepal widths more than 3

In [6]:
print(sqldf('''
SELECT sepal_wid
FROM ds
WHERE sepal_wid > 3
            '''))

    sepal_wid
0         3.5
1         3.2
2         3.1
3         3.6
4         3.9
..        ...
62        3.1
63        3.1
64        3.2
65        3.3
66        3.4

[67 rows x 1 columns]

A query to get sepal widths more than 3 and sepal length more than 6

In [7]:
print(sqldf('''
SELECT sepal_wid, sepal_len
FROM ds
WHERE sepal_wid > 3
AND sepal_len > 6
            '''))

    sepal_wid  sepal_len
0         3.2        7.0
1         3.2        6.4
2         3.1        6.9
3         3.3        6.3
4         3.1        6.7
5         3.1        6.7
6         3.3        6.3
7         3.6        7.2
8         3.2        6.5
9         3.2        6.4
10        3.8        7.7
11        3.2        6.9
12        3.3        6.7
13        3.2        7.2
14        3.8        7.9
15        3.4        6.3
16        3.1        6.4
17        3.1        6.9
18        3.1        6.7
19        3.1        6.9
20        3.2        6.8
21        3.3        6.7
22        3.4        6.2

A query to find small petals.

In [8]:
print(sqldf('''
SELECT petal_len
FROM ds
WHERE petal_len 
BETWEEN 1 AND 1.3
            '''))

    petal_len
0         1.3
1         1.1
2         1.2
3         1.3
4         1.0
5         1.2
6         1.3
7         1.3
8         1.3
9         1.3
10        1.3

This gets the sum of all the sepal lengths

In [9]:
print(sqldf('''
SELECT SUM(sepal_len)
FROM ds
            '''))

   SUM(sepal_len)
0           876.5

This is all the distinct sepal lengths ordered by size greatest to least.

In [10]:
print(sqldf('''
SELECT DISTINCT(sepal_len)
FROM ds
ORDER BY sepal_len DESC
            '''))

    sepal_len
0         7.9
1         7.7
2         7.6
3         7.4
4         7.3
5         7.2
6         7.1
7         7.0
8         6.9
9         6.8
10        6.7
11        6.6
12        6.5
13        6.4
14        6.3
15        6.2
16        6.1
17        6.0
18        5.9
19        5.8
20        5.7
21        5.6
22        5.5
23        5.4
24        5.3
25        5.2
26        5.1
27        5.0
28        4.9
29        4.8
30        4.7
31        4.6
32        4.5
33        4.4
34        4.3

This counts how many rows we have.

In [11]:
print(sqldf('''
SELECT COUNT(*)
FROM ds
            '''))

   COUNT(*)
0       150

This gives the petal width when the petal is 3 cm long.

In [13]:
print(sqldf('''
SELECT petal_len, petal_wid
FROM ds
GROUP BY petal_len like 5.0
            '''))

   petal_len  petal_wid
0        1.4        0.2
1        5.0        1.7

In [41]:
ddf = pd.DataFrame(wine.data, columns=wine.feature_names)
ddf

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,13.71,5.65,2.45,20.5,95.0,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740.0
174,13.40,3.91,2.48,23.0,102.0,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750.0
175,13.27,4.28,2.26,20.0,120.0,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835.0
176,13.17,2.59,2.37,20.0,120.0,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840.0
177,14.13,4.10,2.74,24.5,96.0,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560.0

This takes the all the wines above the average alcohol limit.

In [56]:
print(sqldf('''
SELECT alcohol
FROM ddf
WHERE alcohol > (
            SELECT AVG(alcohol)
            FROM ddf
            )
            '''))

    alcohol
0     14.23
1     13.20
2     13.16
3     14.37
4     13.24
..      ...
87    13.71
88    13.40
89    13.27
90    13.17
91    14.13

[92 rows x 1 columns]

This groups the alcohol above the average limit by the amount of ash used, to see if there is a correlation between ash and alcohol levels.

In [57]:
print(sqldf('''
SELECT alcohol, ash
FROM ddf
GROUP BY ash
HAVING AVG(alcohol) > 13 
            '''))

    alcohol   ash
0     13.03  1.71
1     13.05  2.04
2     13.41  2.12
3     13.05  2.13
4     13.20  2.14
5     13.16  2.15
6     14.83  2.17
7     13.49  2.24
8     13.74  2.25
9     12.69  2.26
10    13.86  2.27
11    14.06  2.28
12    14.10  2.30
13    13.36  2.35
14    13.71  2.36
15    13.17  2.37
16    14.38  2.38
17    14.75  2.39
18    14.10  2.40
19    13.75  2.41
20    14.23  2.43
21    14.21  2.44
22    14.20  2.45
23    14.19  2.48
24    14.22  2.51
25    13.05  2.55
26    13.64  2.56
27    13.88  2.59
28    13.83  2.60
29    14.06  2.61
30    13.83  2.62
31    12.93  2.65
32    13.16  2.67
33    13.77  2.68
34    13.58  2.69
35    13.63  2.70
36    14.30  2.72
37    13.11  2.75
38    13.87  2.80
39    13.28  2.84
40    13.40  2.86
41    13.24  2.87
42    13.05  3.22

This is the code for the SQL Murder Myster Data set. I am storing it here.

In [ ]:
/* Who has done an interview */

SELECT Name, transcript
FROM interview A
LEFT JOIN person B
	on A.person_id = B.id
WHERE A.transcript LIKE '__%'
GROUP BY B.name
LIMIT 10

/* How many interviews */

SELECT COUNT(*)
FROM interview A
LEFT JOIN person B
	on A.person_id = B.id
WHERE A.transcript LIKE '__%'